_posts/2015-01-11-tag-time.html
---
date: 2015-01-11
tags: 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: Time Tracking with TagTime
excerpt: How to track your time with TagTime
categories: 
- statistics
featured: false
---
<p>
This semester I'll experimenting with an app called TagTime to track
how I spend my time.
</p>

<div id="outline-container-org6dc718d" class="outline-2">
<h2 id="org6dc718d">Overview</h2>
<div class="outline-text-2" id="text-org6dc718d">
<p>
See <a href="http://www.messymatter.com/tagtime/">this post</a> from the creators<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> for more details, but
essentially the TagTime app provides an easy way for me to track how
I'm spending my time. It pings me at random times (more on this
later) at which time I record exactly what I'm doing through the use
of tags. For example I'll have tags such as <i>PhD</i> for general school
work, <i>TA</i> for my office hours and grading, <i>ADA</i> for my ADA
project, <i>hw</i> for homework, etc.
</p>
</div>
</div>

<div id="outline-container-orge454878" class="outline-2">
<h2 id="orge454878">Purpose</h2>
<div class="outline-text-2" id="text-orge454878">
<p>
As a graduate student, I have a lot of flexibility and independence in
how I spend my time. While I greatly enjoy the freedom this brings, I
also need to be vigilant to make sure that I am making good use of my
time. As a statistician, the first step to deciding how I spend my
time is to collect data <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
I refuse to use a traditional approach such as keeping a journal or
clocking in/out of tasks because I lack the dedication and
attentiveness to maintain those types of records. I need something
relatively automatic and effortless.
</p>

<p>
Because TagTime pings me, I have an instant reminder to keep up with
the records. I don't expect I'll have to spend more than a few seconds
recording my tags as I'm shooting for a big picture accounting of my
time rather than a fine-grained record.
</p>
</div>
</div>

<div id="outline-container-org872daeb" class="outline-2">
<h2 id="org872daeb">Statistical Background</h2>
<div class="outline-text-2" id="text-org872daeb">
<p>
Beyond the benefits to my productivity, I also greatly enjoy this
tool because it appeals to my inner (and outer) stats geek.
</p>
</div>
<div id="outline-container-org7917cb1" class="outline-3">
<h3 id="org7917cb1">Consistency</h3>
<div class="outline-text-3" id="text-org7917cb1">
<p>
The times between pings are drawn iid from an exponential
distribution with a known rate. Thus the pings follow a Poisson
process, which gives us the following interesting result.
</p>

<p>
See <a href="http://www.math.purdue.edu/~peterson/Teaching/532/PASTA.pdf">this paper</a> for the proof, but the basic result is that the
fraction of pings in which I'm performing a certain activity will
converge in probability to the fraction of times I'm performing
that activity <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. Thus I'll have a consistent
estimate of the fraction of time I spend on each activity.
</p>
</div>
</div>

<div id="outline-container-org30b4961" class="outline-3">
<h3 id="org30b4961">Confidence Intervals</h3>
<div class="outline-text-3" id="text-org30b4961">
<p>
The result above is nice, because it allows me to decide how to
characterize uncertainty in my estimates. Since I'm fitting a
sample proportion I'll use a binomial model for each of the tags.
</p>

<p>
Thus for my point estimate I'll have \(\hat{p}\) the fraction of
times I observe a certain tag, with variance \(\hat{p}(1 -
   \hat{p})/N\).
</p>
</div>
</div>

<div id="outline-container-org93a0c77" class="outline-3">
<h3 id="org93a0c77">Memoryless Property</h3>
<div class="outline-text-3" id="text-org93a0c77">
<p>
Another cool aspect is that the exponential distribution is
memoryless. In mathematical terms,
</p>

<p>
\[ \Pr(X > t + \epsilon \mid X > t) = \Pr(X > \epsilon) \]
</p>

<p>
which simply means that however long I've waited for a ping, the
distribution of time I'll have to wait for the next ping is the
same as it was at the start. This means I can't anticipate the next
ping <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.
</p>
</div>
</div>
</div>

<div id="outline-container-org74d5fb1" class="outline-2">
<h2 id="org74d5fb1">Future Musings</h2>
<div class="outline-text-2" id="text-org74d5fb1">
<p>
I'd like to think about how to incorporate known lengths of time into
my estimates. For example, I know exactly how long my lectures and
office hours run, so I should be able to measure that time with very
little uncertainty.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
These are the same brilliant minds that created
<a href="http://www.beeminder.com">Beeminder</a> which you should check out
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Obligatory business adage: "What gets measured, gets
managed"
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Technically, this is only the case if the fraction of
the time I'm performing an activity converges in probability. However,
I can get this convergence if I model my time as a regenerative
process, basically treating my days (or more realistically weeks) as
independent cycles.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Intellectually I know this to be the case, but I
wonder if I'll still anticipate the pings anyways. I imagine the brain
is wired to anticipate events as relatively few things in nature can
be modeled as exponentials.
</p></div></div>


</div>
</div>
